setRatio() {
  static coordsData := {
    16x9: {
      mode: "16x9",
      快捷手册: {
        挑战_灰色: [1490, 160, 1535, 200, 0xbbbbbb],
        挑战_黑色: [1490, 160, 1535, 200, 1513, 185, 0x000000],
        零号空洞: [275, 463, 380, 490, 330, 475, 0xaaaaaa],
        前往: [1424, 353, 1476, 390, 1450, 370, 0xffffff],
        传送: [1000, 600, 1100, 640, 1125, 620, 0x00cc0d]
      },
      角色操作: {
        M: [1170, 880, 1800, 920, 0xffffff],
        Q: [1770, 1020, 1790, 1050, 0xffffff],
        Tab: [1800, 100, 1850, 130, 0xffffff]
      },
      零号选择: {
        资质考核: [240, 700, 260, 750, 0x78cc00],
        旧都列车: [580, 780, 600, 850, 660, 770, 0x78cc00],
        施工废墟: [680, 410, 700, 450, 0x78cc00]
      },
      旧都列车: {
        前线: [1600, 349, 1800, 420, 1706, 374, 0xbff700],
        下一步: [1660, 960, 1740, 1040, 1707, 1028, 0xffffff],
        出战: [1660, 960, 1740, 1040, 1707, 1028, 0xffffff]
      },
      空洞: {
        确认: [840, 620, 1000, 810, 975, 630, 0x00cc0d], ; 有绿勾，确认侵蚀、代理人
        确定: [930, 750, 985, 810, 960, 790, 0xffffff, Ceil(setting.variation / 2)], ; 无绿勾，铭徽确定、催化、选择
        1: {
          右上终点: [1300, 220, 1380, 270, 0xf63d49],
          右下终点: [1300, 840, 1400, 900, 0xeb2a2c],
          战斗: {
            开始: [257, 41, 380, 96, 0x00ff44],
            计时: [1230, 430, 1370, 610, 0xffc300],
            确定键: [1130, 840, 1190, 1020, 0xffffff],
            确定绿勾: [1000, 840, 1040, 1020, 0x00cc0d]
          }
        },
        2: {
          选项框: [1360, 490, 1390, 763],
          降压准备: [850, 700, 870, 760, 960, 730, 0x00cc0d]
        },
        退出副本: {
          放弃: [1580, 960, 1600, 1050, 1712, 1026, 0xcb0000],
          确认: [1000, 600, 1100, 640, 1125, 620, 0x00cc0d]
        },
        结算: {
          零号业绩: [1320, 600, 1440, 666, 0xffb500],
          完成: [1670, 970, 1730, 1040, 1700, 1027, 0xffffff]
        }
      }
    },
    16x10: {
      mode: "16x10",
      角色操作: {
        M: [1170, 880, 1800, 920, 0xffffff],
        Q: [1770, 1020, 1790, 1050, 0xffffff],
        Tab: [1800, 100, 1850, 130, 0xffffff]
      },
      快捷手册: {
        挑战_灰色: [1490, 160, 1535, 200, 0xbbbbbb],
        挑战_黑色: [1490, 160, 1535, 200, 1513, 185, 0x000000],
        零号空洞: [275, 463, 380, 490, 330, 475, 0xaaaaaa],
        前往: [1424, 353, 1476, 390, 1450, 370, 0xffffff],
        传送: [1000, 600, 1100, 640, 1125, 620, 0x00cc0d]
      },
      零号选择: {
        资质考核: [240, 700, 260, 750, 0x78cc00],
        旧都列车: [580, 780, 600, 850, 660, 770, 0x78cc00],
        施工废墟: [680, 410, 700, 450, 0x78cc00]
      },
      旧都列车: {
        前线: [1600, 349, 1800, 420, 1706, 374, 0xbff700],
        下一步: [1660, 960, 1740, 1040, 1707, 1028, 0xffffff],
        出战: [1660, 960, 1740, 1040, 1707, 1028, 0xffffff]
      },
      空洞: {
        确认: [840, 620, 1000, 810, 975, 630, 0x00cc0d],
        确定: [930, 750, 985, 810, 960, 790, 0xffffff, Ceil(setting.variation / 2)],
        1: {
          右上终点: [1300, 220, 1380, 270, 0xf63d49],
          右下终点: [1300, 840, 1400, 900, 0xeb2a2c],
          战斗: {
            开始: [261, 46, 369, 72, 0x00ff44],
            计时: [1230, 430, 1370, 610, 0xffc300],
            确定键: [1130, 840, 1190, 1020, 0xffffff],
            确定绿勾: [1000, 840, 1040, 1020, 0x00cc0d]
          }
        },
        2: {
          选项框: [1360, 490, 1390, 763],
          降压准备: [850, 700, 870, 730, 970, 715, 0x00cc0d]
        },
        退出副本: {
          放弃: [1580, 960, 1600, 1050, 1712, 1026, 0xcb0000],
          确认: [1000, 600, 1100, 640, 1125, 620, 0x00cc0d]
        },
        结算: {
          零号业绩: [1320, 600, 1440, 666, 0xffb500],
          完成: [1670, 970, 1730, 1040, 1700, 1027, 0xffffff]
        }
      }
    },
    5x4: {
      mode: "5x4",
      角色操作: {
        M: [1768, 943, 1787, 957, 0xffffff],
        Q: [1769, 1042, 1786, 1054, 0xffffff],
        Tab: [1802, 84, 1847, 97, 0xffffff]
      },
      快捷手册: {
        挑战_灰色: [1487, 267, 1535, 287, 0xbbbbbb],
        挑战_黑色: [1488, 264, 1535, 283, 1510, 272, 0x000000],
        零号空洞: [273, 483, 383, 503, 326, 493, 0xaaaaaa],
        前往: [1420, 407, 1480, 429, 1450, 415, 0xffffff],
        传送: [986, 589, 1016, 612, 1127, 598, 0x00cc0d]
      },
      零号选择: {
        资质考核: [240, 670, 295, 686, 0x78cc00],
        旧都列车: [581, 740, 746, 755, 662, 715, 0x78cc00],
        施工废墟: [681, 449, 804, 465, 0x78cc00]
      },
      旧都列车: {
        前线: [1608, 401, 1796, 448, 1696, 425, 0xbff700],
        下一步: [1669, 872, 1737, 890, 1700, 881, 0xffffff],
        出战: [1706, 875, 1757, 890, 1727, 884, 0xffffff]
      },
      空洞: {
        确认: [848, 600, 863, 628, 970, 610, 0x00cc0d],
        确定: [935, 710, 989, 729, 960, 718, 0xffffff, Ceil(setting.variation / 2)],
        1: {
          右上终点: [1300, 317, 1382, 328, 0xf63d49],
          右下终点: [1300, 775, 1385, 784, 0xeb2a2c],
          战斗: {
            开始: [260, 36, 372, 56, 0x00ff44],
            计时: [1234, 400, 1371, 750, 0xffc300],
            确定键: [1130, 600, 1190, 950, 0xffffff],
            确定绿勾: [1100, 600, 1040, 950, 0x00cc0d]
          }
        },
        2: {
          选项框: [1358, 503, 1388, 696],
          降压准备: [850, 664, 870, 689, 979, 674, 0x00cc0d]
        },
        退出副本: {
          放弃: [1579, 871, 1599, 895, 1719, 880, 0xcb0000],
          确认: [1003, 592, 1018, 615, 1124, 600, 0x00cc0d]
        },
        结算: {
          零号业绩: [1342, 594, 1427, 626, 0xffb500],
          完成: [1676, 872, 1727, 891, 1700, 882, 0xffffff]
        }
      }
    },
    4x3: {
      mode: "4x3",
      角色操作: {
        M: [1769, 935, 1787, 948, 0xffffff],
        Q: [1768, 1039, 1785, 1052, 0xffffff],
        Tab: [1804, 90, 1846, 104, 0xffffff]
      },
      快捷手册: {
        挑战_灰色: [1487, 250, 1538, 268, 0xbbbbbb],
        挑战_黑色: [1487, 250, 1538, 268, 1509, 260, 0x000000],
        零号空洞: [277, 481, 378, 498, 329, 492, 0xaaaaaa],
        前往: [1424, 397, 1481, 419, 1448, 408, 0xffffff],
        传送: [998, 587, 1015, 619, 1130, 604, 0x00cc0d]
      },
      零号选择: {
        资质考核: [242, 681, 294, 692, 0x78cc00],
        旧都列车: [589, 754, 741, 768, 662, 730, 0x78cc00],
        施工废墟: [678, 444, 806, 460, 0x78cc00]
      },
      旧都列车: {
        前线: [1610, 391, 1798, 445, 1700, 415, 0xbff700],
        下一步: [1667, 896, 1737, 912, 1706, 903, 0xffffff],
        出战: [1708, 898, 1754, 914, 1730, 907, 0xffffff]
      },
      空洞: {
        确认: [850, 605, 865, 636, 977, 621, 0x00cc0d],
        确定: [926, 706, 993, 753, 960, 731, 0xffffff, Ceil(setting.variation / 2)],
        1: {
          右上终点: [1298, 302, 1382, 310, 0xf63d49],
          右下终点: [1297, 790, 1384, 803, 0xeb2a2c],
          战斗: {
            开始: [261, 39, 372, 60, 0x00ff44],
            计时: [1223, 385, 1379, 590, 0xffc300],
            确定键: [1131, 780, 1208, 940, 0xffffff],
            确定绿勾: [1022, 780, 1054, 940, 0x00cc0d]
          }
        },
        2: {
          选项框: [1356, 501, 1388, 709],
          降压准备: [848, 672, 863, 699, 980, 685, 0x00cc0d]
        },
        退出副本: {
          放弃: [1578, 890, 1602, 919, 1721, 907, 0xcb0000],
          确认: [1001, 592, 1017, 620, 1130, 602, 0x00cc0d]
        },
        结算: {
          零号业绩: [1334, 606, 1433, 624, 0xffb500],
          完成: [1673, 898, 1724, 916, 1699, 905, 0xffffff]
        }
      }
    }
    ; 模板: {
    ;   角色操作: {
    ;     M: [0xffffff], ; 4个所需坐标参数，左上XY、右下XY
    ;     Q: [0xffffff],
    ;     Tab: [0xffffff]
    ;   },
    ;   快捷手册: {
    ;     挑战_灰色: [0xbbbbbb],
    ;     挑战_黑色: [ 0x000000], ; 6个所需坐标参数，左上XY、右下XY、默认XY
    ;     零号空洞: [ 0xaaaaaa],
    ;     前往: [ 0xffffff],
    ;     传送: [ 0x00cc0d]
    ;   },
    ;   零号选择: {
    ;     资质考核: [0x78cc00],
    ;     旧都列车: [ 0x78cc00],
    ;     施工废墟: [0x78cc00]
    ;   },
    ;   旧都列车: {
    ;     前线: [ 0xbff700],
    ;     下一步: [ 0xffffff],
    ;     出战: [ 0xffffff]
    ;   },
    ;   空洞: {
    ;     确认: [ 0x00cc0d], ; 有绿勾，确认侵蚀、代理人
    ;     确定: [ 0xffffff, Ceil(setting.variation / 2)], ; 无绿勾，铭徽确定、催化、选择
    ;     1: {
    ;       右上终点: [0xf63d49],
    ;       右下终点: [0xeb2a2c],
    ;       战斗: {
    ;         开始: [0x00ff44],
    ;         计时: [0xffc300],
    ;         确定键: [0xffffff],
    ;         确定绿勾: [0x00cc0d]
    ;       }
    ;     },
    ;     2: {
    ;       选项框: [],
    ;       降压准备: [ 0x00cc0d]
    ;     },
    ;     退出副本: {
    ;       放弃: [ 0xcb0000],
    ;       确认: [ 0x00cc0d]
    ;     },
    ;     结算: {
    ;       零号业绩: [0xffb500],
    ;       完成: [ 0xffffff]
    ;     }
    ;   }
    ; }
  }
  ratio := A_ScreenWidth / A_ScreenHeight
  bestRatio := {
    diff: 251,
    key: "16x9"
  }
  for (key, value in coordsData.OwnProps()) {
    sp := StrSplit(key, "x")
    designRatio := sp[1] / sp[2]
    absRatio := Abs(designRatio - ratio)
    if (absRatio < bestRatio.diff) {
      bestRatio.diff := absRatio
      bestRatio.key := key
    }
    if (designRatio = ratio) {
      global c := value
      return
    }
  }
  MsgBox("警告：`n当前显示器分辨率" A_ScreenWidth "x" A_ScreenHeight "无内置数据`n将使用" bestRatio.key "的分辨率比例数据进行缩放处理`n`n若无法正常运行，请更改分辨率比例为16:9，如1920*1080", "警告", "Icon! 0x40000")
  global c := coordsData.%bestRatio.key%
}